Repository: Christian-Adler/statistics-app
Catalog: lib/l10n/intl_*.arb
Languages: de

# authBtnLogin
source: Login
de: Anmelden

# authErrorMsgAuthenticationFailed
source: Could not authenticate you. Please try again later.
de: Login fehlgeschlagen. Bitte später nochmals versuchen.

# authInputLabelPassword
source: Password
de: Passwort

# authInputValidatorMsgEnterValidServer
source: Enter a valid server!
de: Geben sie einen validen Server an!

# authInputValidatorMsgPasswordToShort
source: Password is too short!
de: Geben sie ein gültiges Passwort ein!

# authSettingsTitle
source: Settings
de: Einstellungen

# bloodPressureAddValueInputLabelDiastolic
source: diastolic (lower) (mmHg)
de: diastolisch (unterer) (mmHg)

# bloodPressureAddValueInputLabelSystolic
source: systolic (upper) (mmHg)
de: systolisch (oberer) (mmHg)

# bloodPressureTableHeadDate
source: Date
de: Datum

# bloodPressureTableHeadEvening
source: Evening
de: Abend

# bloodPressureTableHeadMidday
source: Midday
de: Mittag

# bloodPressureTableHeadMorning
source: Morning
de: Morgen

# carAddValueInputLabelKilometers
source: Mileage (km)
de: km-Stand (km)

# carAddValueInputLabelLiters
source: Liters (rounded) (l)
de: Liter (gerundet) (l)

# carTableHeadDate
source: Date
de: Datum

# commonsLogout
source: Logout
de: Abmelden

# commonsDialogTitleAreYouSure
source: Are you sure?
de: Sind sie sicher?

# commonsDialogTitleErrorOccurred
source: An Error Occurred
de: Fehler

# commonsDialogBtnCancel
source: Cancel
de: Abbrechen

# commonsDialogBtnNo
source: No
de: Nein

# commonsDialogBtnSave
source: Save
de: Speichern

# commonsDialogBtnYes
source: Yes
de: Ja

# commonsMsgErrorFailedToLoadData
source: Failed to load data...
de: Fehler beim Laden der Daten...

# commonsSnackbarMsgSaved
source: Saved...
de: Gespeichert...

# commonsValidatorMsgEmptyValue
source: Please enter a value
de: Bitte Wert eingeben

# commonsValidatorMsgNumberGtZeroRequired
source: Please provide a valid number > 0
de: Bitte gültige Zahl > 0 eingeben

# operatingAddValueInputLabelPower
source: Power (kWh)
de: Strom (kWh)

# operatingAddValueInputLabelPowerFed
source: Power Fed (kWh)
de: Strom Eingespeist (kWh)

# operatingAddValueInputLabelPowerHeatingDay
source: Power Heating HT (kWh)
de: Strom Wärmepumpe HT (kWh)

# operatingAddValueInputLabelPowerHeatingNight
source: Strom Heating NT (kWh)
de: Strom Wärmepumpe NT (kWh)

# operatingAddValueInputLabelWater
source: Water (m³ = alle großen Zahlen)
de: Wasser (m³ = alle großen Zahlen)

# operatingChartPowerConsumed
source: Power consumed (kWh)
de: Strom (kWh)

# operatingChartPowerConsumedTotal
source: Power consumed total (kWh)
de: Strom Verbrauch Gesamt (kWh)

# operatingChartPowerFed
source: Power fed (kWh)
de: Strom Eingespeist (kWh)

# operatingChartPowerGenerated
source: Power generated (kWh)
de: Strom Erzeugt (kWh)

# operatingChartPowerGeneratedOwnConsumption
source: Power generated own consumption (kWh)
de: Strom Erzeugt Eigenverbrauch (kWh)

# operatingChartHeating
source: Heating (kWh)
de: Heizung (kWh)

# operatingChartWater
source: Water (m³)
de: Wasser (m³)

# operatingTitle
source: Operating costs / {period}
de: Betriebskosten / {period}

# operatingTitlePeriodMonth
source: Month
de: Monat

# operatingTitlePeriodYear
source: Year
de: Jahr

# patternsDateWeekdayWithDate
source: E, yyyy-MM-dd
de: E, dd.MM.yyyy

# screenTitleCar
source: Refuel
de: Tanken

# screenTitleCarAddValue
source: Enter refuel
de: Tanken eintragen

# screenTitleHeart
source: Blood pressure
de: Blutdruck

# screenTitleHeartAddValue
source: Enter blood pressure
de: Blutdruck eintragen

# screenTitleLogs
source: Application logs
de: Applikation Logs

# screenTitleOperating
source: Operating
de: Nebenkosten

# screenTitleOperatingAddValue
source: Enter operating costs
de: Betriebskosten eintragen

# screenTitleOverview
source: Overview
de: Übersicht

# screenTitleSettings
source: Settings
de: Einstellungen

# screenTitleSolarPower
source: Solar power
de: Solar-Strom

# screenTitleSolarPowerAddValue
source: Enter solar power yield
de: Solar-Energie-Ertrag eintragen

# settingsDeviceStorageBtnClearStorageAndLogout
source: Clear device storage & logout
de: Lösche gespeicherte App-Daten & Abmelden

# settingsDeviceStorageLabelShowAuthData
source: Show auth data
de: Login-Daten anzeigen

# settingsDeviceStorageTableHeadKey
source: Key
de: Schlüssel

# settingsDeviceStorageTableHeadValue
source: Value
de: Wert

# settingsDeviceStorageTitle
source: Device Storage
de: Geräte-Speicher

# settingsLanguageLabelChooseLanguage
source: Language
de: Sprache

# settingsLanguageTitle
source: Language
de: Sprache

# settingsLayoutLabelShowNavigationTitles
source: Display titles in navigation (drawer, app bar)
de: Texte in Navigation anzeigen (Menü, Navigationsleiste)

# settingsLayoutLabelShowOverviewIsometricButtons
source: Display isometric bar buttons in overview
de: In Übersicht isometrische Buttons anzeigen

# settingsLayoutLabelShowOverviewParallaxEffect
source: Display parallax effect in overview (cpu consuming)
de: In Übersicht Parallax-Effekt anzeigen (CPU intensiv)

# settingsLayoutTitle
source: Layout
de: Anzeige

# settingsServerInputValidatorMsgEnterServer
source: Enter a server
de: Geben sie eine Server-Adresse ein!

# settingsServerInputValidatorMsgProvideValidServer
source: Provide a valid server address
de: Geben sie eine gültige Server-Adresse ein!

# settingsServerSnackbarMsgServerRemoved
source: Server removed...
de: Server entfernt...

# settingsThemeLabelChooseMode
source: Mode
de: Modus

# settingsThemeLabelChooseMainColor
source: Main Color
de: Hauptfarbe

# settingsThemeModeDark
source: Dark Mode
de: Dunkel

# settingsThemeModeLight
source: Light Mode
de: Hell

# settingsThemeModeSystem
source: System Mode
de: System

# settingsThemeTitle
source: Theme
de: Modus & Farbe

# solarPowerAddValueInputLabelPowerGenerated
source: Generated Solar Power (kWh)
de: Erzeugte Solar Energie (kWh)

# solarPowerChartLegendItemConsumption
source: Consumption
de: Verbrauch

# solarPowerChartLegendItemFed
source: Fed
de: Eingespeist

# solarPowerChartLegendItemGenerated
source: Generated
de: Erzeugt

# solarPowerChartLegendItemTotal
source: Total
de: Gesamt

# solarPowerChartSubLegendPriceAndFee
source: Price : {price} €/kWh, Basic fee : {feePerMont} €/Monat
de: Preis : {price} €/kWh, Grundgebühr : {feePerMont} €/Monat

# solarPowerTitlePeriodMonth
source: Month
de: Monat

# solarPowerTitlePeriodYear
source: Year
de: Jahr

# solarPowerTableHeadConsumption
source: Consumption
de: Verbrauch

# solarPowerTableHeadConsumptionAbbrev
source: Consum.
de: Verbr.

# solarPowerTableHeadDate
source: Date
de: Datum

# solarPowerTableHeadFed
source: Fed
de: Eingespeist

# solarPowerTableHeadFedAbbrev
source: Fed
de: Eingesp.

# solarPowerTableHeadGenerated
source: Generated
de: Erzeugt

# solarPowerTableHeadGeneratedAbbrev
source: Gener.
de: Erzeugt

# solarPowerTableHeadTotal
source: Total
de: Gesamt

# solarPowerTableHeadTotalAbbrev
source: Total
de: Gesamt
